Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/back_to_education/back_to_education_programme.html.txt.tmx
Source language: en
Languages: ga

source: Back to Education Programme
ga: Clár ar ais chun Oideachais

source: The Back to Education Programme can support you to take part in educational and personal development courses that will help you to access employment. There are 3 different options under the Back to Education Programme:
ga: Féadfaidh an Clár ar Ais Chun Oideachais tacaíocht a thabhairt duit páirt a ghlacadh i gcúrsaí um fhorbairt phearsanta agus oideachasúil chun chuidiú leat fostaíocht a fháil

source: The Back to Education Allowance
ga: Liúntas Ar Ais Chun Oideachais

source: The Back to Education Allowance can support people getting a social welfare payment to access second-level and third-level education and limited post-graduate courses
ga: Féadfaidh Clár Ar Ais Chun Oideachais cabhrú le daoine atá ag fáil íocaíocht leasa shóisialaigh le rochtain ar oideachas dara agus tríú leibhéal

source: If you are unemployed, the Part-Time Education Option allows you to keep your Jobseeker's Allowance or Jobseeker's Benefit and attend a part-time day or evening course that will improve your chances of getting a job (including Springboard courses). You continue to get your jobseeker's payment at your usual rate. You must also continue to be available for and actively seeking work. This means you still need to sign on at your Social Welfare Local Office. There are no specific eligibility criteria for the Part-Time Education Option. You can be any age and may be unemployed for any length of time before starting a part-time course of education
ga: Má tá tú dífhostaithe, ceadaíonn Rogha Oideachais Páirtaimseartha duit do Liúntas do Lucht Cuardaigh Fostaíochta nó Sochar do Lucht Cuardaigh Fostaíochta a choinneáil agus freastal ar chúrsa páirtaimseartha lae/tráthnóna sa dóigh go mbeidh seans níos fearr agat le post a fháil

source: Education, Training and Development Option
ga: Rogha Oideachais, Oiliúna agus Forbartha

source: If you are getting Jobseeker's Allowance or Jobseeker's Benefit, the Education, Training and Development Option allows you to keep your social welfare payment and attend a course not covered by the standard Back to Education Allowance such as a personal development course, a basic education course (for example, literacy classes) a general training course or specific job skills. You continue to get your jobseeker's payment at your usual rate
ga: Ma tá tú ag fáil Liúntais nó Sochair do Lucht Cuardaigh Fostaíochta is féidir leat freastal ar chúrsa nach bhfuil clúdaithe ag gnáth Liúntas Ar Ais Chun Oideachais, ar nós cúrsa forbartha pearsanta, cúrsa oideachais bunúsaigh (mar shampla, ranganna litearthachta), cúrsa oiliúna ginearálta agus jabscileanna éagsúla

source: You must meet certain criteria to qualify for the Education, Training and Development Option
ga: Léigh tuilleadh faoi na critéir cáilithe le haghaidh Rogha Oideachais, Oiliúna agus Forbartha
